DocumentJournals/ДокументыОсновныеСредстваСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыОсновныеСредстваСклад</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ИнвентаризацияОС</xr:Item>
				<xr:Item>Document.СписаниеОС</xr:Item>
				<xr:Item>Document.ОприходованиеОС</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ОприходованиеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СписаниеОС.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОприходованиеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СписаниеОС.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Склад</Name>
					<References>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Склад</xr:Item>
						<xr:Item>Document.ОприходованиеОС.Attribute.Склад</xr:Item>
						<xr:Item>Document.СписаниеОС.Attribute.СкладОтправитель</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

AccumulationRegisters/АК_ОсновныеСредстваКСписаниюОприходованию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>АК_ОсновныеСредстваКСписаниюОприходованию</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DocumentJournals/ДокументыОсновныеСредстваСклад/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьНадписьАкты();	
	
КонецПроцедуры

Функция КоличествоОСКОформлению()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNULL(КОЛИЧЕСТВО(АК_ОсновныеСредстваКСписаниюОприходованиюОстатки.ОсновноеСредство),0) КАК КОЛИЧЕСТВО
		|ИЗ
		|	РегистрНакопления.АК_ОсновныеСредстваКСписаниюОприходованию.Остатки КАК АК_ОсновныеСредстваКСписаниюОприходованиюОстатки
		|ГДЕ
		|	АК_ОсновныеСредстваКСписаниюОприходованиюОстатки.КоличествоОстаток <> 0";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;

	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ОбновитьНадписьАкты()

	КоличествоОСКОформлению = КоличествоОСКОформлению();
	
	Элементы.ГруппаБезОтклонений.Видимость = (КоличествоОСКОформлению = 0);
	Элементы.ГруппаЕстьОтклонения.Видимость = (КоличествоОСКОформлению > 0);

    Элементы.НадписьОтклонения.Заголовок = "Не сформированы акты по основным средствам: " + КоличествоОСКОформлению + " шт.";		
		
КонецПроцедуры	

&НаКлиенте
Процедура НадписьСформироватьНажатие(Элемент)
	
	ОткрытьФорму("ЖурналДокументов.ДокументыОсновныеСредстваСклад.Форма.ФормаФормированиеАктов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбновитьНадписьАкты();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормирование(Команда)
	
	ОткрытьФорму("ЖурналДокументов.ДокументыОсновныеСредстваСклад.Форма.ФормаФормированиеАктов");
	
КонецПроцедуры
